# №1 Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на позиции с нечетным индексом.
# Пример:
# [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

# Решение

# my_list = [2, 3, 4, 20, 23, 2, 57, 200] #225
# summ = 0
# for i in range(len(my_list)):
#     if i % 2 != 0:
#         summ = summ + my_list[i]
# print(f'Сумма: {summ}')

    