# 1№. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Пример:
# 6782 -> 23
# 0,56 -> 11

# Решение:
# num = float(input('Введите число: '))

# num1 = int(num)
# num2 = (num - num1)
# num2 = num2 * 10**(len(str(num2))-2)
# sum = 0

# while num1 > 0:
#     sum += num1 % 10
#     num1 //= 10

# while num2 > 0:
#     sum += num2 % 10
#     num2 //= 10
# print(int(sum))

